const arrayOfLoveWishes = [
    "Нехай кожен день приносить радість і тепло!",
    "Любові та щастя вам!",
    "Нехай кохання буде вічним!",
    "Нехай завжди панує любов!",
    "Хай буде багато сердечок у душі!",
    "Нехай цей День Святого Валентина принесе тобі море кохання і ніжності!",
    "Бажаю, щоб у твоєму серці завжди квітла любов, як сьогодні!",
    "Хай цей день буде наповнений романтикою, теплом і щасливими моментами!",
    "Нехай у твоєму житті завжди буде людина, яка кохає тебе всім серцем!",
    "Бажаю, щоб твоє серце билося в унісон із серцем коханої людини!",
    "Хай кожен погляд і дотик сьогодні будуть сповнені любові!",
    "Нехай у твоєму житті буде багато солодких поцілунків і ніжних обіймів!",
    "Хай День Валентина подарує тобі незабутні романтичні миті!",
    "Нехай любов буде твоєю вірною супутницею на все життя!",
    "Бажаю безмежного щастя, справжнього кохання та приємних сюрпризів у цей особливий день!",
]

document.getElementById('btn_love_wishes').addEventListener('click', () =>{
let index = Math.floor(Math.random() * arrayOfLoveWishes.length)
document.getElementById('love-wishes').innerText= arrayOfLoveWishes[index]
})